<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Word;

class WordSeeder extends Seeder
{
    public function run(): void
    {
        Word::truncate();

        $data = [
            [
                'word' => 'Ականջ դնել',
                'description' => 'կարևորություն տալ, բանի տեղ դնել ("Շատ անգամ տեսնում էի, մեյդանում, փողոցում մեկ քոռ աշըղի էնպես են հայիլ-մայիլ մնացել ու կանգնել, ականջ դնում, փող բաշխում նրան։")',
            ],
            [
                'word' => 'Հայիլ-մայիլ մնալ',
                'description' => 'ապշել, զարմանալ ("Շատ անգամ տեսնում էի, մեյդանում, փողոցում մեկ քոռ աշըղի էնպես են հայիլ-մայիլ մնացել ու կանգնել...")',
            ],
            [
                'word' => 'Աչքերը գնալ',
                'description' => 'քունը տանել, քնել ("Բնությունը իր պատքը պահանջեց, աչքերս գնաց։")',
            ],
            [
                'word' => 'Աչքը բաց լինել',
                'description' => 'տեսնել ամեն բան ("Ա՜խ, լեզուս փա’կ էր, աչքս՝բաց...")',
            ],
            [
                'word' => 'Արևին մեռնել',
                'description' => 'սիրո, երախտագիտության արտահայտություն ("ձեր արևին մեռնիմ")',
            ],
            [
                'word' => 'Բերնից էլ ոսկի վեր ածել',
                'description' => 'շատ ճարտար խոսել ("ասքի հենց բերնիցդ էլ ոսկի վեր ածիր")',
            ],
            [
                'word' => 'Գերեզմանն առաջին տեսնել',
                'description' => 'զգալ մոտալուտ մահ ("Ամեն օր գերեզմանս առաջիս տեսնում էի...")',
            ],
            [
                'word' => 'Գլխից դուրս տալ',
                'description' => 'ինքնուրույն ստեղծել ("Էնքան եմ գրաբառ գլխիցս դուս տվել...")',
            ],
            [
                'word' => 'Գլուխը մահու տալ',
                'description' => 'ինքնասպան լինել ("Շատ անգամ ուզում էի իմ գլուխս մահու տամ։")',
            ],
            [
                'word' => 'Գլուխը պրծացնել',
                'description' => 'փրկվել վտանգից ("Շունչը բերնին հասած՝փախչում էր...")',
            ],
            [
                'word' => 'Գլուխը տալ',
                'description' => 'մահու հանձն առնել ("Դեռ գլուխը չտված՝հենց իմացավ...")',
            ],
            [
                'word' => 'Գլուխը ցույց տալ',
                'description' => 'երևալ ("Ես էլ էի ուզում, որ իմ գլուխս ցույց տամ...")',
            ],
            [
                'word' => 'Ընկնել սար ու ձոր',
                'description' => 'աննպատակ շրջել ("Գժվածի պես ընկնում էի սար ու ձոր...")',
            ],
            [
                'word' => 'Թող աչքս հանեն',
                'description' => 'երդման ձև ("Մեր լեզվումը թե էսպիսի բաներ ըլին, թող աչքս հանեն։")',
            ],
            [
                'word' => 'Լեզուն կապը կտրել',
                'description' => 'սկսել խոսել ("պապանձած լեզուն էլ իր կապը կտրեց...")',
            ],
            [
                'word' => 'Լեզուն փակ լինել',
                'description' => 'չկարողանալ խոսել ("լեզուս փակ էր...")',
            ],
            [
                'word' => 'Լեզուն կարճ լինել',
                'description' => 'չկարողանալ արտահայտվել ("լեզուս կարճ էր...")',
            ],
            [
                'word' => 'Լեզուն բաց անել',
                'description' => 'համարձակվել խոսել ("մունջ լեզուս բաց արեց")',
            ],
            [
                'word' => 'Լեզուն բաց լինել',
                'description' => 'ազատ խոսել ("Լեզուս բաց ա էլել...")',
            ],
            [
                'word' => 'Խելքը բերել',
                'description' => 'հասկանալ ("ինչքան խելքս կբերի...")',
            ],
            [
                'word' => 'Խակ լեզու',
                'description' => 'տհաս լեզու ("քո որդու խակ լեզուն սիրես")',
            ],
            [
                'word' => 'Կրակը ջանը առնել',
                'description' => 'ուժեղ հուզվել ("կրակը ջանս առավ")',
            ],
            [
                'word' => 'Հոգին առնել',
                'description' => 'մահանալ ("հոգիս առավ")',
            ],
            [
                'word' => 'Հոգին մաշել',
                'description' => 'տանջվել ("հոգիս էրում, մաշում էր")',
            ],
            [
                'word' => 'Հոգին տեղահան լինել',
                'description' => 'շատ վախենալ ("հոգիս տեղըհան էլավ")',
            ],
            [
                'word' => 'Ձեն տալ',
                'description' => 'գոչել ("ինձ անդադար ձեն էին տալիս")',
            ],
            [
                'word' => 'Ձեռը պակաս լինել',
                'description' => 'չկարողանալ օգնել ("ձեռս պակաս էր")',
            ],
            [
                'word' => 'Ճարը կտրվել',
                'description' => 'ելք չունենալ ("Ճարս կտրվեց...")',
            ],
            [
                'word' => 'Մատով ցույց տալ',
                'description' => 'ակնհայտ ցույց տալ ("Մատով ցույց էր տալիս...")',
            ],
            [
                'word' => 'Մազերը պոկել',
                'description' => 'հուսահատվել ("ուզում էի մազերս պոկեմ")',
            ],
            [
                'word' => 'Մարդի սիրտը գրավել',
                'description' => 'հիացնել ("մարդի սիրտը կարող է գրավել")',
            ],
            [
                'word' => 'Մեյդան բաց անել',
                'description' => 'հուզմունք առաջանալ ("սրտումս մեյդան բաց արին")',
            ],
            [
                'word' => 'Մտիկ անել',
                'description' => 'ուշադրություն դարձնել ("չէի մտիկ անում")',
            ],
            [
                'word' => 'Շունչը բերնին հասնել',
                'description' => 'ուժասպառ լինել ("Շունչը բերնին հասած")',
            ],
            [
                'word' => 'Շունչը հանել',
                'description' => 'ամեն ինչ տալ ("ուզում էի շունչս էլ հանեմ")',
            ],
            [
                'word' => 'Շունչը բերանում լինել',
                'description' => 'դեռ կենդանի լինել ("շունչս բերանումս")',
            ],
            [
                'word' => 'Ոտը կոխել',
                'description' => 'ոտք դնել ("որտեղ որ իմ ազգը ոտը կոխել ա")',
            ],
            [
                'word' => 'Պատիվ տալ',
                'description' => 'հարգել ("պատիվ են տալիս")',
            ],
            [
                'word' => 'Ջուրն ընկնել',
                'description' => 'անզոր լինել ("ջուրն ընկնիլ")',
            ],
            [
                'word' => 'Ջանը դուրս գալ',
                'description' => 'չարչարվել ("ջանը դուրս գա")',
            ],
            [
                'word' => 'Ջանին մեռնել',
                'description' => 'սիրո արտահայտություն ("նրա ջանին մեռնիմ")',
            ],
            [
                'word' => 'Սիրտը կրակ ընկնել',
                'description' => 'խոր վիշտ ունենալ ("սիրտս կրակ ա ընկել")',
            ],
            [
                'word' => 'Սիրտը պատռել',
                'description' => 'խոր ցավ ապրել ("սիրտս ուզում էր պատռի")',
            ],
            [
                'word' => 'Սիրտը լիքը լինել',
                'description' => 'ծանրաբեռնված լինել ("սիրտս լիքը տուն գալիս")',
            ],
            [
                'word' => 'Սիրտ ունենալ',
                'description' => 'զգացմունք ունենալ ("ով սիրտ ունի")',
            ],
            [
                'word' => 'Սիրտը դողալ',
                'description' => 'վախենալ ("սիրտս դողում էր")',
            ],
        ];

        Word::insert($data);
    }
}
